# # 算数运算符: + - * / // % **
# print("10 + 4 =" ,10 + 4) # 加
# print("10 - 4 =", 10 - 4) # 减
# print("10 * 4 =", 10 * 4) # 乘
# print("10 / 4 =", 10 / 4) # 除 - 2.5
# print("10 // 4 =",10 // 4)# 整除(结果为整数) - 2
# print("10 % 4 =",10 % 4) # 取/求模 - 2
# print("10 ** 4=" ,10 ** 4)#幂指数,10的4次方
#
# # 算术运算符的优先级 ---> **  --> * / // % --> + -
# # 加括号可以提高优先级
# print("0.1 + 10 / 4 ** 2 = ", 0.1 + 10 / 4 ** 2)

# 输入两个数x和y，计算x+y以及x-y的结果并输出
x = float(input("请输入x: "))
y = float(input("请输入y: "))

# 0.09999999999999998 -->精度损失：由于计算机底层是基于二进制进行数据存储和处理
#二进制无法精确表示表示所有的小数。因此涉及浮点数运算时，可能损失精度
print("x + y = ",x + y)
print("x - y = ",x - y)
